In [1]:
import numpy as np
import pandas  as pd
from pandas import Series,DataFrame

In [2]:
data=Series(['one','two',np.nan,'four'])
data

0     one
1     two
2     NaN
3    four
dtype: object

In [3]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
data.dropna()

0     one
1     two
3    four
dtype: object

In [5]:
npn=np.nan

In [6]:
df=DataFrame([[1,2,3],[npn,5,6],[7,npn,9],[npn,npn,npn]])
df

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [7]:
clean_df=df.dropna()
clean_df

     0    1    2
0  1.0  2.0  3.0

In [8]:
df.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [9]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [26]:
df1=DataFrame([[1,2,3,npn],[2,npn,5,6],[npn,7,npn,9],[1,npn,npn,npn]])
df1

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [27]:
df1.dropna(thresh=1)# row me agar 1 ya 1 se jyda value hogi usko rkhe ga

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [28]:
df1.dropna(thresh=2)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [29]:
df1.dropna(thresh=3)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0

In [30]:
df1.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [31]:
df1.dropna(how='all')

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [32]:
df1.fillna(0)

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0

In [33]:
df1.fillna({0:10,1:20,2:30,3:60})# jis column me value zero h usme

      0     1     2     3
0   1.0   2.0   3.0  60.0
1   2.0  20.0   5.0   6.0
2  10.0   7.0  30.0   9.0
3   1.0  20.0  30.0  60.0

In [34]:
df1.fillna(8,inplace=True)

In [35]:
df1

     0    1    2    3
0  1.0  2.0  3.0  8.0
1  2.0  8.0  5.0  6.0
2  8.0  7.0  8.0  9.0
3  1.0  8.0  8.0  8.0